[{"title:": "Scientists Explore Outback as Testbed for Mars ", "preview:": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}, {"title:": "3 Things We've Learned From NASA's Mars InSight ", "preview:": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title:": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter", "preview:": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."}, {"title:": "NASA's Mars Perseverance Rover Gets Its Sample Handling System", "preview:": "The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period."}, {"title:": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview:": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title:": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "preview:": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"title:": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview:": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "}, {"title:": "NASA's InSight 'Hears' Peculiar Sounds on Mars", "preview:": "Listen to the marsquakes and other, less-expected sounds that the Mars lander has been detecting."}, {"title:": "NASA's Mars Helicopter Attached to Mars 2020 Rover ", "preview:": "The helicopter will be first aircraft to perform flight tests on another planet."}, {"title:": "From JPL's Mailroom to Mars and Beyond", "preview:": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"title:": "NASA's Perseverance Rover 100 Days Out", "preview:": "Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car."}, {"title:": "NASA to Reveal Name of Its Next Mars Rover", "preview:": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday. "}, {"title:": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "preview:": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"title:": "Meet the People Behind NASA's Perseverance Rover", "preview:": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "}, {"title:": "Curiosity Mars Rover's Summer Road Trip Has Begun", "preview:": "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."}]